app/views/admin/items/index.html.erb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <td>
            <% if item.genre.present? %>