app/views/admin/items/new.html.erb

            <div class="col-8">
                <%= f.collection_select :genre_id, Genre.where(effective_flag: "true"), :id, :name, include_blank: "選択して下さい" %>
---
SELECT "genres".* FROM "genres" WHERE "genres"."effective_flag" = ?  [["effective_flag", 1]]