app/views/admin/items/show.html.erb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <div class="col-8">
            <% unless @item.genre.name.blank? %>