app/controllers/admin/end_users_controller.rb

  def index
    @end_users = EndUser.all
---
SELECT "end_users".* FROM "end_users"

  def show
    @end_user = EndUser.find(params[:id])
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @end_user = EndUser.find(params[:id])
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @end_user = EndUser.find(params[:id])
    if @end_user.update(end_user_params)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "end_users" SET "postal_code" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["postal_code", "2530021"], ["updated_at", "2020-07-12 10:37:32.101981"], ["id", 1]]