app/controllers/admin/genres_controller.rb

  def index
    @genre = Genre.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @genre = Genre.new(genre_params)
    @genres = Genre.all
    if @genre.save
---
SELECT "genres".* FROM "genres"
INSERT INTO "genres" ("name", "created_at", "updated_at", "effective_flag") VALUES (?, ?, ?, ?)  [["name", "グミ"], ["created_at", "2020-07-12 06:50:25.440043"], ["updated_at", "2020-07-12 06:50:25.440043"], ["effective_flag", 0]]

  def edit
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "effective_flag" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["effective_flag", 0], ["updated_at", "2020-07-12 14:36:35.725936"], ["id", 3]]