app/controllers/admin/items_controller.rb

  def top
    @items = Item.all
---
SELECT "items".* FROM "items"

  def index
    @items = Item.all.search(params[:search])
---
SELECT "items".* FROM "items" WHERE (name LIKE '%クッキー%')

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("genre_id", "image_id", "name", "description", "price_excluding_tax", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "price_excluding_tax" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", nil], ["price_excluding_tax", 2000], ["updated_at", "2020-07-12 06:42:54.665331"], ["id", 2]]