app/controllers/admin/order_details_controller.rb

  def update
    @order_detail = OrderDetail.find(params[:id])
    @order = Order.find(@order_detail.order_id)
    if params[:order_detail][:production_status] == "in_production"
      @order.order_status = "in_production"
      @order.save
    end
    if @order_detail.update(order_detail_params)
      count_production_completed = 0
      @order.order_details.each do |order_detail|
        if order_detail.production_status == "production_completed"
          count_production_completed += 1
        end
      end
      if @order.order_details.count == count_production_completed
        @order.order_status = "preparing_for_shipping"
        @order.save
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
UPDATE "order_details" SET "production_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["production_status", 2], ["updated_at", "2020-07-11 06:30:33.437941"], ["id", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 3], ["updated_at", "2020-07-11 13:42:44.181590"], ["id", 1]]
UPDATE "order_details" SET "production_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["production_status", 3], ["updated_at", "2020-07-11 13:33:58.113399"], ["id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 4], ["updated_at", "2020-07-11 13:45:09.114381"], ["id", 1]]