app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])
    @end_user = EndUser.find(@order.end_user_id)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 3], ["updated_at", "2020-07-11 12:37:52.655448"], ["id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "order_details" SET "production_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["production_status", 2], ["updated_at", "2020-07-11 13:34:38.935732"], ["id", 1]]
---
  def update
    @order = Order.find(params[:id])
    if @order.update(order_params)
      if params[:order][:order_status] == "confirmed_payment"
        @order.order_details.each do |order_detail|
          order_detail.production_status = "awaiting_production"
          order_detail.save