app/views/admin/orders/index.html.erb

SELECT "orders".* FROM "orders"
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
          <% amount = 0 %>
          <% order.order_details.each do |order_detail| %>