app/views/admin/orders/show.html.erb

      <div class="col-2">
        <%= f.select  :order_status, Order.order_statuses.keys.map {|k| [I18n.t("enums.order.order_status.#{k}"), k]} %>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

          <% total_price = 0 %>
          <% @order.order_details.each do |order_detail| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]