app/views/orders/new.html.erb

              <div class="col-10">
                <%= current_end_user.postal_code %> <%= current_end_user.address %> <%= current_end_user.first_name + current_end_user.last_name %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 2]]