app/views/orders/show.html.erb

                  <% item_prices = 0 %>
                  <% @order.order_details.each do |order_detail| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]

            <tbody>
            <% @order.order_details.each do |order_detail| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]