app/controllers/addresses_controller.rb

  def index
    @addresses = current_end_user.addresses.all
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 1]]

  def edit
    @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @addresses = current_end_user.addresses.all
    @address = Address.new(address_params)
    @address.end_user_id = current_end_user.id
    if @address.save
---
INSERT INTO "addresses" ("end_user_id", "postal_number", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["end_user_id", 1], ["postal_number", "aaaaaa"], ["address", "aaaa"], ["name", "aaaaaa"], ["created_at", "2020-06-15 03:54:01.482702"], ["updated_at", "2020-06-15 03:54:01.482702"]]