app/controllers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ? LIMIT ?  [["end_user_id", 2], ["LIMIT", 1]]
---
  def index
    @cart_items = CartItem.where(end_user_id: current_end_user.id)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["end_user_id", 2], ["item_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 5], ["updated_at", "2020-06-11 11:49:46.900166"], ["id", 6]]
INSERT INTO "cart_items" ("end_user_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 2], ["item_id", 1], ["amount", 1], ["created_at", "2020-06-11 11:49:06.034277"], ["updated_at", "2020-06-11 11:49:06.034277"]]
---
  def create
    @cart_item = CartItem.new(cart_item_params)
    if current_end_user.cart_items.find_by(item_id: params[:cart_item][:item_id]).present?
      @cart_present_item = current_end_user.cart_items.find_by(item_id: params[:cart_item][:item_id])
      @cart_present_item.amount = @cart_present_item.amount + @cart_item.amount
      @cart_present_item.save(cart_item_params)
      redirect_to cart_items_path
    else
      @cart_item.end_user_id = current_end_user.id
      @cart_item.save(cart_item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 7], ["updated_at", "2020-07-09 10:19:09.090946"], ["id", 5]]
---
  def update
    @cart_items = CartItem.where(end_user_id: current_end_user.id)
    @cart_item = CartItem.find(params[:id])
    if @cart_item.update(cart_item_params)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]
---
  def destroy
    cart_item = CartItem.find(params[:id])
    cart_item.destroy

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 2]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 6]]
---
  def all_destroy
    cart_items = CartItem.where(end_user_id: current_end_user.id)
    cart_items.destroy_all