app/controllers/end_users_controller.rb

  def update
    @end_user = current_end_user
    if @end_user.update(end_user_params)
---
UPDATE "end_users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["first_name", "aaa"], ["last_name", "aaa"], ["updated_at", "2020-06-06 03:41:41.658473"], ["id", 1]]

  def leave
    @end_user = current_end_user
    @end_user.update(is_working: false)
---
UPDATE "end_users" SET "is_working" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["is_working", 0], ["updated_at", "2020-07-12 07:06:33.891236"], ["id", 1]]