app/controllers/items_controller.rb

  def index
    @items = Item.where(is_working: "true").search(params[:search])
---
SELECT "items".* FROM "items" WHERE "items"."is_working" = ? AND "items"."is_working" = ?  [["is_working", 1], ["is_working", 1]]