app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."end_user_id" = ? AND "orders"."end_user_id" = ? LIMIT ?  [["end_user_id", 1], ["end_user_id", 1], ["LIMIT", 1]]
---
  def index
    @orders = current_end_user.orders

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ? AND "cart_items"."end_user_id" = ?  [["end_user_id", 1], ["end_user_id", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ? AND "cart_items"."end_user_id" = ? LIMIT ?  [["end_user_id", 3], ["end_user_id", 3], ["LIMIT", 11]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."end_user_id" = ? AND "orders"."end_user_id" = ? LIMIT ?  [["end_user_id", 1], ["end_user_id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 6]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["end_user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def check
    @order = Order.new
    @cart_items = current_end_user.cart_items.where(end_user_id: current_end_user.id)
    if  params[:order][:address_option] == "0"
      @order.name = current_end_user.first_name + current_end_user.last_name
      @order.post_number = current_end_user.postal_code
      @order.address = current_end_user.address
      @order.method_payment = params[:order][:method_payment]
    elsif params[:order][:address_option] == "1"
      @address = current_end_user.addresses.find_by(id: params[:order][:address_id])

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def end
    current_end_user.cart_items.destroy_all

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["end_user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def new
    @order = Order.new
    @order.end_user_id = current_end_user.id
    @addresses = Address.where(end_user_id: current_end_user.id)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["end_user_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("end_user_id", "name", "post_number", "address", "postage", "method_payment", "totsl_payment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 2]]
SELECT "order_details".* FROM "order_details"
INSERT INTO "order_details" ("order_id", "item_id", "tax_included_price", "quantitty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 1], ["item_id", 2], ["tax_included_price", 2200], ["quantitty", 1], ["created_at", "2020-07-12 15:55:09.454335"], ["updated_at", "2020-07-12 15:55:09.454335"]]
---
  def create
    @order = Order.new(order_params)
    @order.end_user_id = current_end_user.id
    @addresses = Address.where(end_user_id: current_end_user.id)
    if @order.save(order_params)
      current_end_user.cart_items.each do |cart_item|
        order_detail = OrderDetail.new
        order_detail.order_id = @order.id
        order_detail.item_id = cart_item.item_id
        order_detail.quantitty = cart_item.amount
        order_detail.tax_included_price = (cart_item.item.price_excluding_tax * 1.1)
        if order_detail.save

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 6]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."end_user_id" = ? LIMIT ?  [["end_user_id", 2], ["LIMIT", 1]]
---
    def set_cart_item
      if current_end_user.cart_items.empty?

SELECT "orders".* FROM "orders" WHERE "orders"."end_user_id" = ?  [["end_user_id", 2]]
SELECT  1 AS one FROM "orders" WHERE "orders"."end_user_id" = ? LIMIT ?  [["end_user_id", 2], ["LIMIT", 1]]
---
    def exist_order
      if current_end_user.orders.empty?